app/views/movies/show.html.erb

  <p>
    <%= link_to pluralize(@movie.reviews.size, "Review"), movie_reviews_path(@movie) %>
---
SELECT COUNT(*) FROM "reviews" WHERE "reviews"."movie_id" = ?  [["movie_id", 1]]